# System Zone Element Type Cooling Set Point Property

Source: https://www.revitapidocs.com/2026/da3fb2e1-8549-0251-db02-403daebae41b.htm

---

| System Zone Element Type Cooling Set Point Property |
| --- |

The cooling temperature set point in unit Kelvin (K).
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CoolingSetPoint { get; set; }
```

```
Public Property CoolingSetPoint As Double
	Get
	Set
```

```
public:
property double CoolingSetPoint {
	double get ();
	void set (double value);
}
```

```
member CoolingSetPoint : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: |

See Also

#### Reference

SystemZoneElementType Class Autodesk.Revit.DB.Mechanical Namespace